DROP TABLE IF EXISTS student CASCADE;
DROP TABLE IF EXISTS teacher CASCADE;
DROP TABLE IF EXISTS subject CASCADE;
DROP TABLE IF EXISTS mark CASCADE;
DROP TABLE IF EXISTS teacher_subject CASCADE;

CREATE TABLE student(
	id SERIAL,
	first_name varchar(30) NOT NULL,
	last_name varchar(30) NOT NULL,
	course integer NOT NULL,
	CHECK ( course >=1 AND course <=5),
	PRIMARY KEY ( id )
);

CREATE TABLE teacher(
	id SERIAL,  
	first_name varchar(30) NOT NULL,
	last_name varchar(30) NOT NULL,
	email varchar(30) NOT NULL,
	PRIMARY KEY ( id )
); 

CREATE TABLE subject(
	id SERIAL,
	title varchar(70) NOT NULL,
	duration integer NOT NULL,
	course integer NOT NULL,
	CHECK ( course >=1 AND course <=5),
	PRIMARY KEY ( id )
);
  
CREATE TABLE teacher_subject (
	teacher_id integer NOT NULL,
	subject_id integer NOT NULL,
	FOREIGN KEY ( teacher_id )
		REFERENCES teacher (id ) ON DELETE CASCADE,
	FOREIGN KEY ( subject_id )
		REFERENCES subject (id ) ON DELETE CASCADE,
	PRIMARY KEY (teacher_id, subject_id)
);

CREATE TABLE mark (
	student_id integer NOT NULL,
	subject_id integer NOT NULL,
	grade char NOT NULL,
	CHECK (grade in ('A', 'B', 'C', 'D', 'E', 'F') ),
	FOREIGN KEY ( student_id )
		REFERENCES student (id ) ON DELETE CASCADE,
	FOREIGN KEY ( subject_id )
		REFERENCES subject (id ) ON DELETE CASCADE,
	PRIMARY KEY (student_id, subject_id)
);

INSERT INTO student (first_name, last_name, course) VALUES 
	('Андрей', 'Алексеев', 1),
 	('Иван', 'Андреев', 2),
 	('Вероника', 'Борисова', 1),
 	('Ирина', 'Гурченкова', 3),
 	('Тимофей', 'Демочкин', 2),
 	('Максим', 'Калугин', 4),
 	('Андрей', 'Коротков', 1),
 	('Анастасия', 'Кравчук', 3),
 	('Степан', 'Михальченков', 2),
  	('Максим', 'Остапенко', 5),
  	('Максим', 'Мухин', 4),
 	('Юлия', 'Саврухина', 1),
 	('Ирина', 'Симонова', 2),
  	('Олег', 'Усов', 5),
 	('Данила', 'Черногузов', 3),
	('Дмитрий', 'Исторкин', 3),
	('Вероника', 'Виноградова', 3),
	('Дарья', 'Кондаурова', 1),
 	('Анастасия', 'Коникова', 4),
	('Виталий', 'Лунгу', 2),
 	('Ульяна', 'Орешкова', 2),
	('Дарья', 'Пыркова', 1),
	('Алина', 'Ручьева', 1),
 	('Кирилл', 'Фролов', 5),
 	('Алексей', 'Шпис', 5),
 	('Денис', 'Хомяков', 4),
 	('Карина', 'Хомякова', 5),
 	('Диана', 'Помозова', 2);

 
 INSERT INTO teacher (last_name, first_name, email)	VALUES
	('Бабекин', 'Максим', 'mbabekin@mail.ru'),
	('Бирюков', 'Андрей', 'abirukov@mail.ru'),
	('Глухова', 'София', 'sgluhova@mail.ru'),
	('Каледина', 'Каледина', 'mkaledina@mail.ru'),
	('Кутин', 'Петр', 'pkutin@mail.ru'),
	('Маленков', 'Павел', 'pmalenkov@mail.ru'),
	('Лосева', 'Элона', 'eloseva@mail.ru'),
	('Павлов', 'Михаил', 'mpavlov@mail.ru'),
	('Смирнов', 'Вадим', 'vsmirnov@mail.ru');

INSERT INTO subject (title, duration, course)	VALUES
	('рисунок', 110, 1),
	('живопись', 115, 1),
	('черчение', 95, 1),
	('пропедевтика', 87, 1),
	('пластическая анатомия', 100, 1),
	('философия', 100, 2),
	('начертательная геометрия', 120, 2),
	('фотографика', 80, 2),
	('дизайн и рекламные технологии', 112, 2),
	('история искусств', 115, 2),
	('эстетика', 117, 3),
	('проектирование в ГД', 140, 3),
	('техника графики', 130, 3),
	('компьютерные технологии', 142, 3),
	('история орнамента', 82, 3),
	('рисунок', 102, 4),
	('художественно-техническое редактирование', 112, 4),
	('предпечатная подготовка', 100, 4),
	('авторское право', 95, 4),
	('рекламная фотография', 105, 4),
	('пиар-технологии', 105, 5),
	('организация проектной деятельности', 110, 5),
	('история графического дизайна и рекламы', 132, 5),
	('технология полиграфии', 118, 5),
	('моделирование', 148, 5);
	
INSERT INTO teacher_subject (teacher_id, subject_id) VALUES
	(1, 1),	 (1, 2),  (1, 3),  (1, 8),  (1, 11), (1, 14), (1, 22),
	(2, 1),	 (2, 4),  (2, 9),  (2, 21), (2, 17), (2, 20), (2, 22),
	(3, 5),	 (3, 11), (3, 23), (3, 2),  (3, 16), (3, 18), (3, 21),
	(4, 6),  (4, 3),  (4, 20), (4, 10), (4, 17), (4, 23), (4, 24),
	(5, 8),  (5, 4),  (5, 21), (5, 19), (5, 12), (5, 24), (5, 25),
	(6, 4),	 (6, 15), (6, 13), (6, 9),  (6, 7),  (6, 19), 
	(7, 5),	 (7, 6),  (7, 7),  (7, 10), (7, 12), 
	(8, 13), (8, 14), (8, 15), (8, 16), (8, 18), 
	(9, 25), (9, 1),  (9, 15), (9, 11);
	
	
	
	
INSERT INTO mark ( student_id, subject_id, grade) VALUES
	(1,  1,  'A'), (1,  2,  'B'), (1,  3,  'A'), (1,  4,  'A'), (1,  5,  'B'),
	(3,  1,  'B'), (3,  2,  'B'), (3,  3,  'C'), (3,  4,  'A'), (3,  5,  'C'),
	(7,  1,  'A'), (7,  2,  'C'), (7,  3,  'B'), (7,  4,  'C'), (7,  5,  'D'),
	(12, 1,  'F'), (12, 2,  'D'), (12, 3,  'D'), (12, 4,  'A'), (12, 5,  'C'),
	(18, 1,  'C'), (18, 2,  'A'), (18, 3,  'B'), (18, 4,  'B'), (18, 5,  'A'),
	(22, 1,  'A'), (22, 2,  'F'), (22, 3,  'C'), (22, 4,  'A'), (22, 5,  'B'),
	(23, 1,  'B'), (23, 2,  'D'), (23, 3,  'A'), (23, 4,  'D'), (23, 5,  'F'),
	(2,  6,  'A'), (2,  7,  'A'), (2,  8,  'A'), (2,  9,  'A'), (2,  10, 'B'),
	(5,  6,  'C'), (5,  7,  'C'), (5,  8,  'A'), (5,  9,  'B'), (5,  10, 'D'),
	(9,  6,  'D'), (9,  7,  'C'), (9,  8,  'C'), (9,  9,  'A'), (9,  10, 'C'),
	(13, 6,  'B'), (13, 7,  'B'), (13, 8,  'C'), (13, 9,  'F'), (13, 10, 'A'),
	(20, 6,  'F'), (20, 7,  'A'), (20, 8,  'B'), (20, 9,  'D'), (20, 10, 'C'),
	(21, 6,  'B'), (21, 7,  'A'), (21, 8,  'B'), (21, 9,  'A'), (21, 10, 'A'),
	(28, 6,  'A'), (28, 7,  'A'), (28, 8,  'A'), (28, 9,  'A'), (28, 10, 'B'),
	(4,  11, 'A'), (4,  12, 'A'), (4,  13, 'A'), (4,  14, 'A'), (4,  15, 'A'),
	(8,  11, 'B'), (8,  12, 'B'), (8,  13, 'C'), (8,  14, 'D'), (8,  15, 'C'),
	(15, 11, 'C'), (15, 12, 'D'), (15, 13, 'C'), (15, 14, 'B'), (15, 15, 'F'),
	(16, 11, 'F'), (16, 12, 'C'), (16, 13, 'B'), (16, 14, 'A'), (16, 15, 'D'),
	(17, 11, 'B'), (17, 12, 'A'), (17, 13, 'A'), (17, 14, 'B'), (17, 15, 'A'),
	(6,  16, 'A'), (6,  17, 'C'), (6,  18, 'B'), (6,  19, 'A'), (6,  20, 'A'),
	(11, 16, 'A'), (11, 17, 'B'), (11, 18, 'A'), (11, 19, 'B'), (11, 20, 'A'),
	(19, 16, 'C'), (19, 17, 'C'), (19, 18, 'D'), (19, 19, 'F'), (19, 20, 'D'),
	(26, 16, 'B'), (26, 17, 'B'), (26, 18, 'C'), (26, 19, 'B'), (26, 20, 'B'),
	(10, 21, 'A'), (10, 22, 'A'), (10, 23, 'A'), (10, 24, 'D'), (10, 25, 'A'),
	(14, 21, 'B'), (14, 22, 'C'), (14, 23, 'D'), (14, 24, 'C'), (14, 25, 'B'),
	(24, 21, 'F'), (24, 22, 'F'), (24, 23, 'C'), (24, 24, 'A'), (24, 25, 'C'),
	(25, 21, 'A'), (25, 22, 'A'), (25, 23, 'A'), (25, 24, 'A'), (25, 25, 'A'),
	(27, 21, 'B'), (27, 22, 'A'), (27, 23, 'C'), (27, 24, 'C'), (27, 25, 'C');
	


